{"data":{"site":{"siteMetadata":{"title":"Edgar Pino's Blog","author":"Edgar Pino"}},"markdownRemark":{"id":"24212208-cc96-588f-9dc8-24912458f57a","excerpt":"Hello, this is just something I found interesting on one of my CP courses. Four types of computers are: PC’s or personal computer. This type…","html":"<p>Hello, this is just something I found interesting on one of my CP courses.</p>\n<h3>Four types of computers are:</h3>\n<ul>\n<li>\n<p>PC’s or personal computer. This type of computer is for the everyday use by a common person. It can be a desktop or a laptop that can handle simple and sometimes complex processing.</p>\n</li>\n<li>\n<p>Servers: These computers are typically used by many people, most of the time remotely. They are designed to run large programs such as database and web servers. They can be big or small like a P.C depending on its need.</p>\n</li>\n<li>\n<p>Supercomputers: These computers are equipped with the highest performance parts available and are typically in the millions of dollars. They are set-up as servers but they are tasked with complex mathematical computations, running simulations, and such.</p>\n</li>\n<li>\n<p>Embedded Computers. These are found inside cars, televisions, and similar electronics thats purpose is to do mainly one task.</p>\n</li>\n</ul>\n<h3>High-level, assembly level, and baniray languge.</h3>\n<p>The steps that a high-level language goes through to be readable by a computer processor are:</p>\n<ul>\n<li>The high-level C program written</li>\n<li>The program is then compiled into an assembly level language.</li>\n<li>This is now considered a low-level program</li>\n<li>Assembly level language is relative to the computer architecture.</li>\n<li>The program is then assembled into binary language that a processor can understand.</li>\n</ul>\n<p>Not all languages follow this pattern, some don’t compile into an assembly level language at all and skip to binary.</p>","frontmatter":{"title":"Quick note on computers and programming languages","date":"January 14, 2015"}}},"pageContext":{"slug":"/quick-note-on-computers-and-programming-languages/","previous":{"fields":{"slug":"moving-my-blog-to-gatsby-js"},"frontmatter":{"title":"Moving my blog to Gatsby.js"}},"next":null}}