{"data":{"site":{"siteMetadata":{"title":"Edgar Pino's Blog","author":"Edgar Pino"}},"markdownRemark":{"id":"3a5f409d-987d-5137-a085-90719dcd33dd","excerpt":"Today, I decided to move my personal blog from Ghost to Gatsby.js and I love it.\nI spent about 30 minutes reading the documentation and…","html":"<p>Today, I decided to move my personal blog from Ghost to Gatsby.js and I love it.\nI spent about 30 minutes reading the documentation and decided Gatsby.js was the way to go, specially now with v2 out.\nIt’s built using tools and frameworks I already use like React.js, Node.js, and Prettier. There wasn’t much I needed to learn.</p>\n<h3>What is Gatsby.js</h3>\n<p>The Github description says it well:</p>\n<blockquote>\n<p>Gatsby.js is a Blazing fast modern site generator for React.\nIt allows developers to create static sites using React with multiple data sources via GraphQL.</p>\n</blockquote>\n<p>Some of the features I like:</p>\n<ol>\n<li>Performance by default with code splitting, image optimization, and lazy-loading.</li>\n<li>Multiple data sources. You can pull data from markdown files, REST APIs, and pretty much any other data source. This is all made accesible via GraphQL.</li>\n<li>Modern and flexible architecture. Gatsby uses React.js and GraphQL at it’s core that allows developers to create almost any type of website. It also includes Prettier and ESLint to help you follow best practices and patterns.</li>\n</ol>\n<h3>Development Experience</h3>\n<p>One of the main reasons I decided to use Gatsby.js was for it’s development experience.\nIt offers a great CLI to easily bootstrap new projects along with starter templates. I used the Gatsby starter template for creating a blog which had everything I needed out of the box. Prettier and ESLint come pre-installed and configured which is great for code consistency and applying best patterns.</p>\n<p>The only thing I needed to do was transfer over my old blog posts from Ghost. That was easy to do since they were already in markdown.</p>\n<h3>Useful Links</h3>\n<ol>\n<li><a href=\"https://www.gatsbyjs.org/\">GatsbyJs</a></li>\n<li><a href=\"https://prettier.io/\">Prettier</a></li>\n</ol>","frontmatter":{"title":"Moving my blog to Gatsby.js","date":"September 20, 2018"}}},"pageContext":{"slug":"moving-my-blog-to-gatsby-js","previous":{"fields":{"slug":"/2018/08/09/number-predictor-using-tensorflow-js-and-mnist-dataset/"},"frontmatter":{"title":"Number Predictor using Tensorflow.js and MNIST dataset"}},"next":null}}